---
kind: type
id: T:Autodesk.Revit.DB.ExternalDBApplicationResult
source: html/d7873d96-ce3d-a8d1-d1d7-c95b65fd79b8.htm
---
# Autodesk.Revit.DB.ExternalDBApplicationResult

Informs Autodesk Revit of the status of your external db application after execution.

## Syntax (C#)
```csharp
public enum ExternalDBApplicationResult
```